;; -*- no-byte-compile: t; -*-
;;; .doom.d/packages.el

;;; Examples:
;; (package! another-package :recipe (:host github :repo "username/repo"))


(package! rust-mode)
(package! eglot)
;;(package! lsp-mode)
(package! cargo)
(package! rutic)
(package! company-box)

(package! js2-mode)
(package! js2-refactor)
;(package! xref-js2)
(package! company-tern)
(package! ac-js2)
(package! web-beautify)
;(package! auto-complete)
;(package! tern-auto-complete)
(package! tern)
(package! react-snippets)
;(package! smart-tabs-mode)
(package! web-mode)
